src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>ВходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МатериалыСобственные</name>
      <description>Материалы (собственные)</description>
    </items>
    <items>
      <name>МатериалыКлиента</name>
      <description>Материалы клиента</description>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
    </items>
    <items>
      <name>Услуги</name>
      <description>Услуги</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетБухгалтерскогоУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/ПоступлениеТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
// Форма документа "ПоступлениеТоваровИУслуг".
// Управляет интерактивным заполнением, автоматическим расчётом сумм,
// подстановкой статей затрат и установкой ответственного по умолчанию.

// ============================================================
//  Серверные обработчики
// ============================================================

// При создании нового документа на сервере:
//   - Если ответственный не заполнен, подставляем текущего пользователя
//     из параметров сеанса (это ссылка на элемент справочника "Пользователи").
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
    Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
        Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
    КонецЕсли;
КонецПроцедуры

// Серверная функция без контекста формы (быстрее, не передаёт данные формы).
// Возвращает статью затрат, назначенную для переданной номенклатуры (услуги).
// Используется для автозаполнения статьи затрат в строке табличной части "Услуги".
&НаСервереБезКонтекста
Функция ПолучитьСтатьюЗатратПоНоменклатуре(Услуга)
    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Ссылка", Услуга);
    Запрос.Текст=
    "ВЫБРАТЬ
    |    Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат
    |ИЗ
    |    Справочник.Номенклатура КАК Номенклатура
    |ГДЕ
    |    Номенклатура.Ссылка = &Ссылка";
    Выборка = Запрос.Выполнить().Выбрать();
    Выборка.Следующий();
    Возврат Выборка.СтатьяЗатрат;
КонецФункции

// ============================================================
//  Клиентские процедуры пересчёта итоговой суммы документа
// ============================================================

// Обновляет итоговую сумму документа как сумму колонок "Сумма"
// по обеим табличным частям (Товары и Услуги).
&НаКлиенте 
Процедура ПересчётСуммыДокумента()
    Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры   

// ============================================================
//  Обработчики табличной части "Товары"
// ============================================================

// При изменении количества в строке товара:
//   - пересчитываем сумму в строке (Цена * Количество),
//   - обновляем итоговую сумму документа.
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
    СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
    Если СтрокаТЧ <> Неопределено Тогда
        РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
        ПересчётСуммыДокумента();
    КонецЕсли;
КонецПроцедуры

// При изменении цены в строке товара – аналогично пересчитываем сумму.
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
    СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
    Если СтрокаТЧ <> Неопределено Тогда
        РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
        ПересчётСуммыДокумента();
    КонецЕсли;
КонецПроцедуры

// При начале редактирования новой строки (копирование существующей):
//   - пересчитываем итог, так как появилась новая сумма.
&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
    Если Копирование Тогда
        ПересчётСуммыДокумента();
    КонецЕсли;
КонецПроцедуры

// После удаления строки товара пересчитываем итог.
&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
    ПересчётСуммыДокумента();
КонецПроцедуры

// ============================================================
//  Обработчики табличной части "Услуги"
// ============================================================

// Изменение количества в строке услуги: пересчёт строки и итога.
&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
    СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
    Если СтрокаТЧ <> Неопределено Тогда
        РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
        ПересчётСуммыДокумента();
    КонецЕсли;
КонецПроцедуры

// Изменение цены в строке услуги: пересчёт строки и итога.
&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
    СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
    Если СтрокаТЧ <> Неопределено Тогда
        РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
        ПересчётСуммыДокумента();
    КонецЕсли;
КонецПроцедуры

// При выборе услуги в строке:
//   - автоматически подтягиваем статью затрат из справочника "Номенклатура"
//     с помощью серверной функции.
&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
    СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
    Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
        СтрокаТЧ.СтатьяЗатрат = ПолучитьСтатьюЗатратПоНоменклатуре(СтрокаТЧ.Услуга);
    КонецЕсли; 
КонецПроцедуры

// Начало редактирования новой строки (копирование).
&НаКлиенте
Процедура УслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
    Если Копирование Тогда
        ПересчётСуммыДокумента();
    КонецЕсли;
КонецПроцедуры

// После удаления строки услуги.
&НаКлиенте
Процедура УслугиПослеУдаления(Элемент)
    ПересчётСуммыДокумента();
КонецПроцедуры
